Tekla Open API Reference for Tekla Structures 2025
RebarMesh.CrossBarLocation Property
 Defines the location of the crossing bars.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarMesh.RebarMeshCrossBarLocationEnum CrossBarLocation { get; set; }
Public Property CrossBarLocation As RebarMesh.RebarMeshCrossBarLocationEnum
	Get
	Set
Property Value
Type: RebarMesh.RebarMeshCrossBarLocationEnum
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace